DELETE FROM standard_market_category WHERE id in (334);
INSERT INTO standard_market_category (id, name_code, fields_num, multi_market, support_odds, template_pc, template_h5, status, order_no, create_time, modify_time, template_pc_client, template_h5_client) VALUES
(334, 1620719389658897987, 2, 1, '1', 13, 13, 1, 334, 1620719389000, 1623495050253, 13, 13);

DELETE FROM standard_sport_market_category WHERE sport_id = 1 and market_category_id in (334);
INSERT INTO standard_sport_market_category ( sport_id, market_category_id, name_code, desc_name_code, is_collapse, scope_id, status, order_no, template_h5, template_pc, create_time, modify_time, template_pc_client, template_h5_client) VALUES
(1, 334, 1620721743512052047, 1620721743165107947, 1, '3', 1, 161, 0, 2, 1620721743000, 1623495050209, 2, 13);

DELETE FROM standard_market_category_field WHERE id in (1046,1047);
INSERT INTO standard_market_category_field (id, market_category_id, name_code, order_no, create_time, modify_time) VALUES
(1046, 334, 1620725729874613640, 1, 1620725729000, 1621162500000),
(1047, 334, 1620725729210909649, 2, 1620725729000, 1621162500000);

delete from third_market_category where third_source_id = 'TX:264';
INSERT INTO third_market_category (name_code, fields_num, third_source_id, reference_id, data_source_code, active, create_time, modify_time) VALUES
(1392039705052311554, 2, 'TX:264', 334, 'TX', 1, 1620723103188, 1620742183412);

delete from third_sport_market_category where market_category_id in (select id from third_market_category where third_source_id = 'TX:264') and sport_id = 1;
INSERT INTO third_sport_market_category (sport_id, market_category_id, create_time, modify_time)
SELECT 1 ,id,UNIX_TIMESTAMP()*100,UNIX_TIMESTAMP()*1000 from third_market_category where third_source_id = 'TX:264';

delete from third_market_category_field where third_source_id in ('TX:264:1','TX:264:2');
INSERT INTO third_market_category_field (market_category_id, name_code, third_source_id, reference_id, order_no, data_source_code, create_time, modify_time) VALUES
(1392039705052311553, 1392121435070263323, 'TX:264:1', 1046, 1, 'TX', 1620742589143, 1620803544422),
(1392039705052311553, 1392121435070263326, 'TX:264:2', 1047, 2, 'TX', 1620742589143, 1620803544405);
DELETE FROM i18n_market_category
WHERE name_code in (1392121435070263323,1392121435070263326,1392039705052311554,1620721743512052047, 1620721743165107947,1620719389658897987,1620725729210909649,1620725729874613640);
INSERT INTO i18n_market_category (name_code, flag, data_source_code, language_type, text, remark, create_time, modify_time) VALUES
(1392039705052311554, 2, 'TX', 'en', 'PEN - Asian Handicap', NULL, 1620723041789, 1620742122294),
(1620719389658897987, 1, 'TX', 'en', '点球大战-让球', NULL, 1620740969000, 1620890792573),
(1620721743512052047, 2, 'TX', 'en', 'PEN - Asian Handicap', NULL, 1620741695000, 1620741695000),
(1620721743165107947, 2, 'TX', 'en', 'PEN - Asian Handicap', NULL, 1620741742000, 1620741742000),
(1392121435070263323, 2, 'TX', 'en', '{$competitor1} ({-hcp})', NULL, 1620742527750, 1620803483104),
(1392121435070263326, 2, 'TX', 'en', '{$competitor2} ({+hcp})', NULL, 1620742527750, 1620803483100),
(1620725729874613640, 1, 'TX', 'en', '{$competitor1} ({-hcp})', NULL, 1620802149000, 1621162562268),
(1620725729210909649, 1, 'TX', 'en', '{$competitor2} ({+hcp})', NULL, 1620802149000, 1621162562270),
(1620721743512052047, 1, 'PA', 'zh', '点球大战-让球', '', 1620812820857, 1623495041125),
(1620721743512052047, 1, 'PA', 'es', '', '', 1620812820862, 1620812820862),
(1620721743512052047, 1, 'PA', 'it_IT', '', '', 1620812820866, 1620812820866),
(1620721743512052047, 1, 'PA', 'de_DE', '', '', 1620812820870, 1620812820870),
(1620721743512052047, 1, 'PA', 'fr_FR', '', '', 1620812820874, 1620812820874),
(1620721743512052047, 1, 'PA', 'pt', '', '', 1620812820879, 1620812820879),
(1620721743512052047, 1, 'PA', 'ru', '', '', 1620812820884, 1620812820884),
(1620721743512052047, 1, 'PA', 'ja', '', '', 1620812820889, 1620812820889),
(1620721743512052047, 1, 'PA', 'ko', '', '', 1620812820894, 1620812820894),
(1620721743512052047, 1, 'PA', 'th', '', '', 1620812820900, 1620812820900),
(1620721743512052047, 1, 'PA', 'vi', 'PEN - Asian Handicap', '', 1620812820906, 1623495050204),
(1620721743512052047, 1, 'PA', 'ms', '', '', 1620812820911, 1620812820911),
(1620721743512052047, 1, 'PA', 'id', '', '', 1620812820918, 1620812820918),
(1620721743512052047, 1, 'PA', 'zs', '点球大战-让球', '', 1620812820923, 1620812820923),
(1620725729874613640, 1, 'PA', 'zh', '{$competitor1} ({-hcp})', '', 1620890792588, 1621162562268),
(1620725729874613640, 1, 'PA', 'es', '{$competitor1} ({-hcp})', '', 1620890792592, 1621162562268),
(1620725729874613640, 1, 'PA', 'it_IT', '{$competitor1} ({-hcp})', '', 1620890792595, 1621162562268),
(1620725729874613640, 1, 'PA', 'de_DE', '', '', 1620890792598, 1620890792598),
(1620725729874613640, 1, 'PA', 'fr_FR', '', '', 1620890792602, 1620890792602),
(1620725729874613640, 1, 'PA', 'pt', '', '', 1620890792604, 1620890792604),
(1620725729874613640, 1, 'PA', 'ru', '', '', 1620890792606, 1620890792606),
(1620725729874613640, 1, 'PA', 'ja', '', '', 1620890792609, 1620890792609),
(1620725729874613640, 1, 'PA', 'ko', '', '', 1620890792610, 1620890792610),
(1620725729874613640, 1, 'PA', 'th', '', '', 1620890792612, 1620890792612),
(1620725729874613640, 1, 'PA', 'vi', '{$competitor1} ({-hcp})', '', 1620890792614, 1623495742481),
(1620725729874613640, 1, 'PA', 'ms', '', '', 1620890792615, 1620890792615),
(1620725729874613640, 1, 'PA', 'id', '', '', 1620890792617, 1620890792617),
(1620725729210909649, 1, 'PA', 'zh', '{$competitor2} ({+hcp})', '', 1620890792624, 1621162562270),
(1620725729210909649, 1, 'PA', 'es', '{$competitor2} ({+hcp})', '', 1620890792626, 1621162562270),
(1620725729210909649, 1, 'PA', 'it_IT', '{$competitor2} ({+hcp})', '', 1620890792627, 1621162562270),
(1620725729210909649, 1, 'PA', 'de_DE', '', '', 1620890792629, 1620890792629),
(1620725729210909649, 1, 'PA', 'fr_FR', '', '', 1620890792631, 1620890792631),
(1620725729210909649, 1, 'PA', 'pt', '', '', 1620890792632, 1620890792632),
(1620725729210909649, 1, 'PA', 'ru', '', '', 1620890792634, 1620890792634),
(1620725729210909649, 1, 'PA', 'ja', '', '', 1620890792636, 1620890792636),
(1620725729210909649, 1, 'PA', 'ko', '', '', 1620890792638, 1620890792638),
(1620725729210909649, 1, 'PA', 'th', '', '', 1620890792640, 1620890792640),
(1620725729210909649, 1, 'PA', 'vi', '{$competitor1} ({-hcp})', '', 1620890792642, 1623495742504),
(1620725729210909649, 1, 'PA', 'ms', '', '', 1620890792646, 1620890792646),
(1620725729210909649, 1, 'PA', 'id', '', '', 1620890792648, 1620890792648),
(1620719389658897987, 1, 'TX', 'zs', '点球大战-让球', NULL, 1620740969000, 1620890792573),
(1620719389658897987, 1, 'TX', 'zh', '点球大战-让球', NULL, 1620740969000, 1620890792573),
(1620719389658897987, 1, 'TX', 'vi', '点球大战-让球', NULL, 1620740969000, 1620890792573),
(1620721743165107947, 2, 'TX', 'zs', '点球大战-让球', NULL, 1620741742000, 1620741742000),
(1392039705052311554, 2, 'TX', 'zs', 'PEN - Asian Handicap', NULL, 1620723041789, 1620742122294),
(1392039705052311554, 2, 'TX', 'zh', 'PEN - Asian Handicap', NULL, 1620723041789, 1620742122294),
(1392121435070263323, 2, 'TX', 'zs', '{$competitor1} ({-hcp})', NULL, 1620742527750, 1620803483104),
(1392121435070263326, 2, 'TX', 'zs', '{$competitor2} ({+hcp})', NULL, 1620742527750, 1620803483100);


update standard_market_category set modify_time = UNIX_TIMESTAMP()*1000 where id in (334);
